public class Decembereighth2 {
    public static void main(String[] args) {
        /*
        ex code) while(true) {
        System.out.prinln("test")
        }
        while문이란 "반복문"으로 while()의 괄호 안에 조건이 들어가게 되고 위의 코드를 실행해보면 무한으로 동작하는 것을
        볼 수 있습니다.
        while문은 괄호안에 조건이 True(참)이여야 실행을 합니다.

       while(조건식) {
       수행될 문장;
       [증감식 or 분기문];
       }
        그리고 while문 자체에 True를 넣어서 무한으로 동작시키는 경우에는 매우 흔한일이며 자주 사용하기 때문에
        잘 알아두는것이 좋습니다
        저번에도 문제를 풀면서 적었지만 이론을 정리하면서 다시 한번 정리해보겠습니다.
        while문의 특징4가지가 있는데
        1.조건식이 True일때 실행한다
        2.문장 수행이 끝나면 조건식을 다시 확인 후 에 그것이 True라면은 다시 수행
        3.언제까지? 조건식이 false가 될 때 까지 수행
        4.조건식이 false가 되면 반복문을 종료
        위 4가지의 순서로 반복문이 진행됩니다.
        여기서 또 중요한 개념이 나오는데
        while을 한번만 사용하는 것 이 아니라 여러번 사용할 때도 있다 중첩while을 사용할 때 인데
        그때 중요한 이론적인 개념이 필요합니다
        예를 들어봅시다

        int a = 1;
        while(a <= 100) {
        System.out.prinln("test a : ""+a+")
        a = a + 1;
        }
        System.out.println ("test a : ""+a+")
        위의 코드를 실행해보면 100이 아니라 101을 출력하며 시스템을 종료하게 됩니다 왜일까요???
        컴퓨터는 위에서 아래로 읽게 되는데
        컴퓨터가 읽어 내려갈 때 마지막에 더해진 값은 while문이 조건이 True일 때만 실행하다보니 101은받지않고
        종료가 되버린 것 입니다.
        그렇게 때문에 a의 마지막값은 100이 아니라 101인점을 확실하게 알아야합니다.

        나중에 중첩while문을 할 때 예를들어서 나이를 입력 하라고 할 때 잘못 입력 시 다시입력하기 위해
        한바퀴를 돌아 다시 나이를입력하는 입력을 받아야 할때 요긴하게 사용 할 수 있습니다.
         */
    }
}
